Revit 2015 API
DefaultDivideSettings.SetLayout Method
 Sets the default Divided Surface layout for U or V gridlines. This method is obsolete in Revit 2015. Use setSurfaceLayout instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute]
public void SetLayout(
	UVGridlineType gridlines,
	SpacingRuleLayout layout
)
Visual Basic
<ObsoleteAttribute> _
Public Sub SetLayout ( _
	gridlines As UVGridlineType, _
	layout As SpacingRuleLayout _
)
Visual C++
[ObsoleteAttribute]
public:
void SetLayout(
	UVGridlineType gridlines,
	SpacingRuleLayout layout
)
Parameters
gridlines
Type: Autodesk.Revit.DB.UVGridlineType
 U-gridlines or V-gridlines.
layout
Type: Autodesk.Revit.DB.SpacingRuleLayout
 A layout spacing rule.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace